I tried to `terraform destroy` again to start fresh: 
```
upcloud_server.lb[0]: Still destroying... [id=000d52b5-9824-43c4-85e0-e4a4f075b9bb, 10s elapsed]
upcloud_server.manager[1]: Still destroying... [id=00808a64-9a31-4274-b5c4-1938bbfb32bd, 10s elapsed]
upcloud_server.manager[2]: Still destroying... [id=0025fa6c-d9f4-4871-ac25-7b3cbedefc67, 10s elapsed]
upcloud_server.db[0]: Still destroying... [id=0085ea27-ac8f-4a06-a30b-3bfae4e32ef5, 10s elapsed]
upcloud_server.redis[0]: Still destroying... [id=007fb93b-57bd-43e1-8bd3-265d28ae184e, 10s elapsed]
upcloud_server.manager[0]: Still destroying... [id=0051591e-878f-4903-8a77-63733de3f520, 10s elapsed]
upcloud_server.db[0]: Still destroying... [id=0085ea27-ac8f-4a06-a30b-3bfae4e32ef5, 20s elapsed]
upcloud_server.redis[0]: Still destroying... [id=007fb93b-57bd-43e1-8bd3-265d28ae184e, 20s elapsed]
upcloud_server.manager[0]: Still destroying... [id=0051591e-878f-4903-8a77-63733de3f520, 20s elapsed]
upcloud_server.lb[0]: Still destroying... [id=000d52b5-9824-43c4-85e0-e4a4f075b9bb, 20s elapsed]
upcloud_server.manager[2]: Still destroying... [id=0025fa6c-d9f4-4871-ac25-7b3cbedefc67, 20s elapsed]
upcloud_server.manager[1]: Still destroying... [id=00808a64-9a31-4274-b5c4-1938bbfb32bd, 20s elapsed]
2021-07-16T16:16:16.649-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:16 [INFO] Deleting server (server UUID: 0051591e-878f-4903-8a77-63733de3f520): timestamp=2021-07-16T16:16:16.649-0400
2021-07-16T16:16:16.861-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:16 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:16.861-0400
2021-07-16T16:16:21.781-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:21 [INFO] Deleting server (server UUID: 007fb93b-57bd-43e1-8bd3-265d28ae184e): timestamp=2021-07-16T16:16:21.781-0400
2021-07-16T16:16:21.897-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:21 [INFO] Deleting server (server UUID: 0025fa6c-d9f4-4871-ac25-7b3cbedefc67): timestamp=2021-07-16T16:16:21.897-0400
2021-07-16T16:16:21.912-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:21 [INFO] Deleting server (server UUID: 00808a64-9a31-4274-b5c4-1938bbfb32bd): timestamp=2021-07-16T16:16:21.912-0400
2021-07-16T16:16:22.157-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:22 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:22.157-0400
2021-07-16T16:16:22.192-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:22 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:22.192-0400
2021-07-16T16:16:22.252-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:22 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:22.252-0400
upcloud_server.lb[0]: Still destroying... [id=000d52b5-9824-43c4-85e0-e4a4f075b9bb, 30s elapsed]
upcloud_server.db[0]: Still destroying... [id=0085ea27-ac8f-4a06-a30b-3bfae4e32ef5, 30s elapsed]
2021-07-16T16:16:26.905-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:26 [INFO] Deleting server (server UUID: 000d52b5-9824-43c4-85e0-e4a4f075b9bb): timestamp=2021-07-16T16:16:26.905-0400
2021-07-16T16:16:27.035-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:27 [INFO] Deleting server (server UUID: 0085ea27-ac8f-4a06-a30b-3bfae4e32ef5): timestamp=2021-07-16T16:16:27.035-0400
2021-07-16T16:16:27.091-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:27 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:27.090-0400
2021-07-16T16:16:27.224-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:16:27 [INFO] Deleting server storage (storage UUID: ): timestamp=2021-07-16T16:16:27.224-0400
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
╷
│ Error: The request method DELETE is not supported by the resource. (METHOD_NOT_ALLOWED)
│ 
│ 
╵
2021-07-16T16:16:27.397-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:16:27.399-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63529
2021-07-16T16:16:27.400-0400 [DEBUG] provider: plugin exited
```

I manually destroyed everything, removed all the state files, and re-done `terraform init`.

Here it is:
```
➜  terraform git:(main) ✗ terraform apply  
2021-07-16T16:19:34.677-0400 [DEBUG] Adding temp file log sink: /var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/terraform-log902495067
2021-07-16T16:19:34.677-0400 [INFO]  Terraform version: 0.15.0
2021-07-16T16:19:34.677-0400 [INFO]  Go runtime version: go1.16.3
2021-07-16T16:19:34.677-0400 [INFO]  CLI args: []string{"/usr/local/bin/terraform", "apply"}
2021-07-16T16:19:34.677-0400 [DEBUG] Attempting to open CLI config file: /Users/patrickleblanc/.terraformrc
2021-07-16T16:19:34.677-0400 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021-07-16T16:19:34.677-0400 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021-07-16T16:19:34.677-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/.terraform.d/plugins
2021-07-16T16:19:34.677-0400 [DEBUG] ignoring non-existing provider search directory /Users/patrickleblanc/Library/Application Support/io.terraform/plugins
2021-07-16T16:19:34.678-0400 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2021-07-16T16:19:34.678-0400 [INFO]  CLI command args: []string{"apply"}
2021-07-16T16:19:34.679-0400 [DEBUG] New state was assigned lineage "9b60dca9-c0ee-486a-d53b-58a11e073a8d"
2021-07-16T16:19:34.733-0400 [DEBUG] checking for provisioner in "."
2021-07-16T16:19:34.739-0400 [DEBUG] checking for provisioner in "/usr/local/bin"
2021-07-16T16:19:34.739-0400 [INFO]  Failed to read plugin lock file .terraform/plugins/darwin_amd64/lock.json: open .terraform/plugins/darwin_amd64/lock.json: no such file or directory
2021-07-16T16:19:34.739-0400 [INFO]  backend/local: starting Apply operation
2021-07-16T16:19:34.741-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:19:34.741-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:19:34.781-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:19:34.784-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63710
2021-07-16T16:19:34.784-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:19:34.796-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:19:34.796-0400
2021-07-16T16:19:34.837-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin226263477 network=unix timestamp=2021-07-16T16:19:34.837-0400
2021-07-16T16:19:34.837-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:19:34.888-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:19:34.890-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63710
2021-07-16T16:19:34.890-0400 [DEBUG] provider: plugin exited
2021-07-16T16:19:34.890-0400 [INFO]  terraform: building graph: GraphTypeValidate
2021-07-16T16:19:34.890-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:34.890-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:34.891-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:19:34.891-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:19:34.891-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb" references: [upcloud_network.woogo-private-network var.public_key]
2021-07-16T16:19:34.891-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:19:34.891-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:19:34.891-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:19:34.891-0400 [DEBUG] Starting graph walk: walkValidate
2021-07-16T16:19:34.892-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:19:34.892-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:19:34.930-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:19:34.933-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63711
2021-07-16T16:19:34.933-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:19:34.947-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:19:34.947-0400
2021-07-16T16:19:34.986-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: network=unix address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin570190234 timestamp=2021-07-16T16:19:34.986-0400
2021-07-16T16:19:34.986-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:19:35.038-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:19:35.039-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63711
2021-07-16T16:19:35.039-0400 [DEBUG] provider: plugin exited
2021-07-16T16:19:35.039-0400 [INFO]  backend/local: apply calling Plan
2021-07-16T16:19:35.039-0400 [INFO]  terraform: building graph: GraphTypePlan
2021-07-16T16:19:35.040-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:35.040-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:35.040-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:19:35.040-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb (expand)" references: [upcloud_network.woogo-private-network (expand) var.public_key]
2021-07-16T16:19:35.040-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network (expand)" references: []
2021-07-16T16:19:35.040-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:19:35.040-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:19:35.040-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:19:35.041-0400 [DEBUG] Starting graph walk: walkPlan
2021-07-16T16:19:35.041-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:19:35.041-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:19:35.076-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:19:35.078-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63712
2021-07-16T16:19:35.079-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:19:35.090-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:19:35.090-0400
2021-07-16T16:19:35.127-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin144081207 network=unix timestamp=2021-07-16T16:19:35.127-0400
2021-07-16T16:19:35.127-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:19:35.175-0400 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" changed the config value, but that value is unused
2021-07-16T16:19:35.644-0400 [DEBUG] Resource instance state not found for node "upcloud_network.woogo-private-network", instance upcloud_network.woogo-private-network
2021-07-16T16:19:35.644-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:19:35.644-0400 [DEBUG] refresh: upcloud_network.woogo-private-network: no state, so not refreshing
2021-07-16T16:19:35.646-0400 [DEBUG] Resource instance state not found for node "upcloud_server.lb[0]", instance upcloud_server.lb[0]
2021-07-16T16:19:35.646-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:19:35.646-0400 [INFO]  ReferenceTransformer: reference not found: "var.public_key"
2021-07-16T16:19:35.646-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb[0]" references: []
2021-07-16T16:19:35.646-0400 [DEBUG] refresh: upcloud_server.lb[0]: no state, so not refreshing
2021-07-16T16:19:35.648-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:35 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-07-16T16:19:35.648-0400
2021-07-16T16:19:35.650-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an invalid plan for upcloud_server.lb[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface[0].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[0].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[0].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[1].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[1].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[2].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[2].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
2021-07-16T16:19:35.652-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:19:35.654-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63712
2021-07-16T16:19:35.654-0400 [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # upcloud_network.woogo-private-network will be created
  + resource "upcloud_network" "woogo-private-network" {
      + id      = (known after apply)
      + name    = "woogo-private-network"
      + servers = (known after apply)
      + type    = (known after apply)
      + zone    = "us-chi1"

      + ip_network {
          + address            = "10.0.0.0/24"
          + dhcp               = true
          + dhcp_default_route = (known after apply)
          + dhcp_dns           = (known after apply)
          + family             = "IPv4"
          + gateway            = (known after apply)
        }
    }

  # upcloud_server.lb[0] will be created
  + resource "upcloud_server" "lb" {
      + cpu      = (known after apply)
      + hostname = "lb-0"
      + id       = (known after apply)
      + mem      = (known after apply)
      + plan     = "1xCPU-1GB"
      + tags     = [
          + "swarm",
          + "lb",
        ]
      + title    = (known after apply)
      + zone     = "us-chi1"

      + login {
          + create_password   = false
          + keys              = [
              + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDS0UdU1zEfJmxJTPYNdGQCfiiN99EFJhXNzxb+JCov/MwYFB3TKpjZcowLylPXA79FCQgqGDn5621vwN3CEKouYDE//I8w8In/m8CpTrjpUhu9IBOAI76JblCc6z8PAGuMpT+CABvkCJMfQO603Da9poI1G58nH4x0CVD72V9ZElycRHibQXBpLnZVFVl/SOL8UvMJ54GvbVeFHYVrt0vrpMGkwxI8xq3yeLQnAiQKvCnq0wxGooDJrjpFNDHAxpqRb1/x9FV9mHj+Kems0pmX9DsEkgdIpE+SEuJPSwWedgf+ldRBfSs1pMZerLzF4oOhp3GiAi8e4kuxtr84c6Ara1+rqTJ+a2juXAVk4ZucUh22lvFigWJ9OdQx9QiwVErfU8wN7gwuU/tHBhpTWgjopf50i/vmtGtq2qlJVfHe72TFDjbjnidaX+A27JrTcVjD1wrFbxwXuna3mJQB8WK3PhY2kuis/lCNoZ/Tszx8vBPp5UbCIxLt5dkBRB/wC24gG1iw8vqEuoS/3+AyF46CGXw3oe6MsWbyjUvMB6C+0nz7sNAZfs3NOT65NROQiK68I9QM9bfcS9pM43c20zr6OrWGl7H91+fuH/TuK4Z6o27OmMYb/zuQi2CjNx607tIDudYf9GAd+Mkp3i0BfNgvPhZekQUBqRxzXQz1Rm7aSQ== patrick@woogostores.com",
            ]
          + password_delivery = "none"
          + user              = "patrick"
        }

      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "public"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "utility"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "private"
        }

      + template {
          + address = (known after apply)
          + id      = (known after apply)
          + size    = 25
          + storage = "Ubuntu Server 20.04 LTS (Focal Fossa)"
          + tier    = (known after apply)
          + title   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
2021-07-16T16:19:35.656-0400 [DEBUG] command: asking for input: "\nDo you want to perform these actions?"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

2021-07-16T16:19:37.941-0400 [INFO]  backend/local: apply calling Apply
2021-07-16T16:19:37.941-0400 [INFO]  terraform: building graph: GraphTypeApply
2021-07-16T16:19:37.941-0400 [DEBUG] Resource state not found for node "upcloud_network.woogo-private-network", instance upcloud_network.woogo-private-network
2021-07-16T16:19:37.941-0400 [DEBUG] Resource state not found for node "upcloud_server.lb[0]", instance upcloud_server.lb[0]
2021-07-16T16:19:37.942-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:37.942-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:37.942-0400 [DEBUG] ProviderTransformer: "upcloud_network.woogo-private-network" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:37.942-0400 [DEBUG] ProviderTransformer: "upcloud_server.lb[0]" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/upcloudltd/upcloud"]
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "var.public_key" references: []
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "var.zone" references: []
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network" references: []
2021-07-16T16:19:37.943-0400 [INFO]  ReferenceTransformer: reference not found: "count.index"
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb[0]" references: [upcloud_network.woogo-private-network upcloud_network.woogo-private-network upcloud_network.woogo-private-network (expand) var.public_key]
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" references: []
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "upcloud_network.woogo-private-network (expand)" references: []
2021-07-16T16:19:37.943-0400 [DEBUG] ReferenceTransformer: "upcloud_server.lb (expand)" references: []
2021-07-16T16:19:37.944-0400 [DEBUG] Starting graph walk: walkApply
2021-07-16T16:19:37.944-0400 [DEBUG] created provider logger: level=debug
2021-07-16T16:19:37.944-0400 [INFO]  provider: configuring client automatic mTLS
2021-07-16T16:19:37.984-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 args=[.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1]
2021-07-16T16:19:37.988-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63713
2021-07-16T16:19:37.988-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1
2021-07-16T16:19:37.999-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: configuring server automatic mTLS: timestamp=2021-07-16T16:19:37.999-0400
2021-07-16T16:19:38.036-0400 [DEBUG] provider: using plugin: version=5
2021-07-16T16:19:38.036-0400 [DEBUG] provider.terraform-provider-upcloud_v2.1.1: plugin address: address=/var/folders/ck/v6sncj6n0h32mmm73qbm73p40000gn/T/plugin876264044 network=unix timestamp=2021-07-16T16:19:38.036-0400
2021-07-16T16:19:38.079-0400 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/upcloudltd/upcloud\"]" changed the config value, but that value is unused
upcloud_network.woogo-private-network: Creating...
2021-07-16T16:19:38.561-0400 [INFO]  Starting apply for upcloud_network.woogo-private-network
2021-07-16T16:19:38.561-0400 [DEBUG] upcloud_network.woogo-private-network: applying the planned Create change
2021-07-16T16:19:38.562-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:38 [DEBUG] setting computed for "servers" from ComputedKeys: timestamp=2021-07-16T16:19:38.562-0400
2021-07-16T16:19:38.562-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:38 [DEBUG] setting computed for "ip_network.0.dhcp_dns" from ComputedKeys: timestamp=2021-07-16T16:19:38.562-0400
2021-07-16T16:19:38.562-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:38 [DEBUG] setting computed for "ip_network.0.dhcp_dns" from ComputedKeys: timestamp=2021-07-16T16:19:38.562-0400
upcloud_network.woogo-private-network: Creation complete after 0s [id=03c462a9-da4d-4e01-a4a3-e8f8a4a9a995]
2021-07-16T16:19:39.123-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:39 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2021-07-16T16:19:39.123-0400
2021-07-16T16:19:39.126-0400 [WARN]  Provider "registry.terraform.io/upcloudltd/upcloud" produced an invalid plan for upcloud_server.lb[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface[0].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[0].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[0].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[1].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[1].bootable: planned value cty.False for a non-computed attribute
      - .network_interface[1].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].ip_address_family: planned value cty.StringVal("IPv4") for a non-computed attribute
      - .network_interface[2].source_ip_filtering: planned value cty.True for a non-computed attribute
      - .network_interface[2].bootable: planned value cty.False for a non-computed attribute
upcloud_server.lb[0]: Creating...
2021-07-16T16:19:39.126-0400 [INFO]  Starting apply for upcloud_server.lb[0]
2021-07-16T16:19:39.127-0400 [DEBUG] upcloud_server.lb[0]: applying the planned Create change
2021-07-16T16:19:44.472-0400 [INFO]  provider.terraform-provider-upcloud_v2.1.1: 2021/07/16 16:19:44 [INFO] Server lb-0 (managed by terraform) with UUID 00cbef10-03d4-4740-88b8-2bc7671c22fb created: timestamp=2021-07-16T16:19:44.472-0400
╷
│ Error: The requested action is forbidden. (ACTION_FORBIDDEN)
│ 
│   on infra.tf line 93, in resource "upcloud_server" "lb":
│   93: resource "upcloud_server" "lb" {
│ 
╵
2021-07-16T16:19:44.852-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-07-16T16:19:44.854-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/upcloudltd/upcloud/2.1.1/darwin_amd64/terraform-provider-upcloud_v2.1.1 pid=63713
2021-07-16T16:19:44.854-0400 [DEBUG] provider: plugin exited
```

Just a thought: I'm using a subaccount for this. could it be the issue?
